/*推荐数据*/
var commendList = [
  {
    title: "APP新请假方式来袭，告别纸质请假条，到底是优是劣？",
    titleId: 1,
    problem_des: "最近，学校为了进一步加强课堂考勤管理，于5月13日开始在全校推行易班APP“请假助手”。",
    commendImg: "http://7niu.meishufan.cn/uploads/textarea_image/image/3934/ggl.jpg",
    content: "匿名用户：最近，学校为了进一步加强课堂考勤管理，于5月13日开始在全校推行易班APP“请假助手”。",
    likeNum: "211",
    commentNum: "5",
    colleactionNum: "10",
    author: "匿名用户",
    avatar: "/image/avatar/avatar-2.png",
    dateTime: "24小时前",
    detailImg: ["http://www.agri35.com/UploadFiles/img_1_643915225_1826730036_26.jpg"],
    detail: "😊最近，学校为了进一步加强课堂考勤管理，于5月13日开始在全校推行易班APP“请假助手”。\n通过对比原来的请假制度，我发现，新版的请假方式，有以下几个特点：\n\n1.告别了开纸质假条的过程，不用再提前去系办找辅导员请假，直接在线上申请就可以了。\n2.不能够事后补假，必须要提前请假。\n3.请假必须要上传相关证明。例如:要请病假，必须上传病历；请事假前，家长与辅导员有联系沟通。（如果暂时不能提供相关证明，可先提交请假申请，并及时向辅导员说明情况，待拿到证明材料后，再上传，重新提交请假。如遇到不可抗的原因，不能提前通过手机请假，可以找相关单位、部门出具纸质版证明材料，经核实就可以事后补假。）\n4.每张假条都有一个由系统生成的编号，可以避免伪造假条的现象。\n\n还有一点需要注意的是：“请假助手”推行的第一周还承认纸质版假条，从推行第二周（5月20日）起，大家只能通过“请假助手”请假。\n\n综合上面的四个特点，新的请假方式，省去了到辅导员办公室找辅导员批假条的麻烦，在手机就可以请假，也防止了部分同学钻“事后补假”的漏洞。",
    answerId: 301,
    collectionStatus: false,  //收藏
    likeStatus: false,       //点赞
    heartStatus: false,       //感谢
    addStatus: false,
    addProStatus: false,
    //回答
    answers: [{

      author: '匿名用户',
      author_img: "/image/avatar/avatar-2.png",
      ans_img: "http://7niu.meishufan.cn/uploads/textarea_image/image/3934/ggl.jpg",
      content: '匿名用户：最近，学校为了进一步加强课堂考勤管理，于5月13日开始在全校推行易班APP“请假助手”。',
      likeNum: "211",
      commentNum: "5",
      create_time: '1552007650',
    },
      {

        author: '匿名用户',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "http://img.tukexw.com/img/4291c8d2c3212bde.jpg",
        content: '匿名用户：最近，学校为了进一步加强课堂考勤管理，于5月13日开始在全校推行易班APP“请假助手”。',
        likeNum: "211",
        commentNum: "5",
        create_time: '1552007650',
      },
      {

        author: '匿名用户',
        author_img: "/image/avatar/avatar-4.png",
        ans_img: "http://i-1.chuzhaobiao.com/2018/8/1/9127d627-350f-42dc-9db1-4129b9d0a11b.jpg",
        content: '匿名用户：省略。',
        likeNum: "211",
        commentNum: "5",
        create_time: '1552007650',
      },
    ],

    //评论
    comments: [
    {
      author: '你别乱说啊',
      avatar: "/image/avatar/avatar-11.png",
      create_time: '1553000500',
      content: {
        txt: '至少不需要爬好几层楼去排队开假条吧？但是能不能及时审批也是一个问题啊',
        img: [],
        audio: null
      }
    },
      {
        author: '袁老师',
        avatar: "/image/avatar/avatar-10.png",
        create_time: '1553000600',
        content: {
          txt: '如果同学们对这个新的APP有什么疑问的，欢迎去广金学工公众号后台，留言询问。学生处的老师们会很详细的给大家解答问题。而且是最官方最权威的👌👌👌',
          img: [],
          audio: null
        }
      },
      {
        author: '#Insistence',
        avatar: "/image/avatar/avatar-9.png",
        create_time: '1553000610',
        content: {
          txt: '事真多，总是花时间在这种无聊的东西上',
          img: ["http://www.agri35.com/UploadFiles/img_2_2437478366_4118478292_26.jpg"],
          audio: null
        }
      },
      {
        author: 'fullsun',
        avatar: "/image/avatar/avatar-5.png",
        create_time: '1553000620',
        content: {
          txt: '在宿舍胃痛头痛姨妈痛，难道还要去专门去搞个病历？？？？💢',
          img: ["/image/answer/a3.jpeg"],
          audio: null
        }
      },
      {
        author: '匿名用户',
        avatar: "/image/avatar/avatar-7.png",
        create_time: '1553000630',
        content: {
          txt: '客观滴说，易班这个功能符合很多同学的需求吧，毕竟请假的规章制度就摆在那里，你都符合要求了，学校还能不让你请吗？你都符合了，只用手机发送能节省时间和精力，除此以外，也可以更好地规范请假的秩序，这对学校还是学生而言都是很棒的做法呢！当然这个运用刚刚上线，可能有些不足，但我相信我们给它足够的时间和经验，一定会越来越完善，我们的请假也会更方便！（我真心为我下周不用跑的老远，找辅导员请假开心）',
          img: [],
          audio: null
        }
      },
    ]
  },
  {
    title: "学校网络为什么这么差呀？会影响到大家的生活质量吗？",
    titleId:2,
    problem_des:"学校的手机网络真的严重影响到了我的生活啊！有时候想查找资料都一直在等刷出来。",
    commendImg: "/image/answer/a2.jpeg",
    content: "阿D：众所周知，我们的学校是联通网覆盖的，因此，移动常常被吐槽。但是近期联通真的是联不通啊！！",
    likeNum: "211",
    colleactionNum:"5",
    commentNum: "3",
    author:"阿D",
    avatar: "/image/avatar/avatar-1.png",
    dateTime:"24小时前",
    detailImg: ["/image/answer/a2.jpeg"],
    detail:"众所周知，我们的学校是联通网覆盖的，因此，移动常常被吐槽。\n不知道大家有没过这样的情形：\n\xa0\xa0\xa0\xa0\xa0当你煲剧却只能刷缓冲时!\n\xa0\xa0\xa0\xa0\xa0当你吃鸡却掉线一整局时!\n\xa0\xa0\xa0\xa0\xa0当你刷微博图片却出来时!\n这种感觉真的是像极了十级火山要爆发了却被sei住了口，简直要原地爆炸啊💥💥！！\n总结一句话就是：移动移不动，联通联不通，电信信不过！😢\n\n学校网络再🧼吐槽，主要原因有以下几点：\n1、基站建设数量不够，随着扩大招生，校园移动和联通的用户数量不断上升，然而学校的基站却没有增加。手机信号依靠4G基站来分配的，一个基站所能发出的信号是有限的，分的人越多，每个人能分配到的信号自然就越弱了。\n2、无限流量的引进。现在大家使用流量的需求越来越大，而且很多同学使用的是无限流量或者大容量套餐，无时无刻的上网下载视频或看视频等，这样一来就会造成网络拥堵，网速自然就慢下来了。\n3、使用无限流量的同时速度也在受到限制。\n投诉内容就两句话：",
    detailImg1:"",
    detail1:"\n\xa0\xa0广东金融学院校园里手机信号太差了！多建基站！多建基站！",
    answerId:101,
    collectionStatus:false,  //收藏
    likeStatus:false,       //点赞
    heartStatus:false,       //感谢
    addStatus: false,
    addProStatus:false,
    //回答
    answers:[{
      
      author: '阿D',
      author_img: "/image/avatar/avatar-1.png",
      ans_img: "/image/answer/a2.jpeg",
      content: '阿D：众所周知，我们的学校是联通网覆盖的，因此，移动常常被吐槽。',
      likeNum: "211",
      commentNum: "5",
      create_time: '1552007650',
    },
    {
      
      author: '匿名用户',
      author_img: "/image/avatar/avatar-1.png",
      ans_img: "/image/answer/a3.jpeg",
      content: '匿名用户：同学们一定要积极行动起来，一起拨打市长电话，期待移动/联通/电信网络都乖乖听话的一天到来！',
      likeNum: "211",
      commentNum: "5",
      create_time: '1552007750',

    },

    ],

    //评论
    comments:[             
    {
      author:'Shay',
      avatar: "/image/avatar/avatar-7.png",
      create_time:'1553000600',
      content:{
        txt: '还好要毕业了，不然这生活是过不下去了，网速差也就算了，半夜超过十一点半停电还充不了电费....',
        img: ["/image/answer/a3.jpeg"],
        audio:null
      }
    },
    {
      author: 'Stin',
      avatar: "/image/avatar/avatar-5.png",
      create_time: '1552979999',
      content: {
        txt: '想问一下楼下的那个免费的信号放大器怎么问到的啊！',
        img: [],
        audio: null
      }
    },
    {
      author: 'NICOLE',
      avatar: "/image/avatar/avatar-9.png",
      create_time: '1552879999',
      content: {
        txt: '我投诉了宿舍移动信号不好四五次了！然后他给我装了信号放大器，免费的，一切解决',
        img: [],
        audio: null
      }
    },
      
    ]             
},
{
  title: "你见过最精彩的营销案例是什么?",
  titleId: 3,
  problem_des: "dlksd;;sf",
  commendImg: "/image/hanbaowang.jpeg",
  content: "精于设计的whaleDesign：除了杜蕾斯，汉堡王也是一枚不走寻常路的妖艳贱货呀。论和麦当劳相爱相杀的，肯德基还不够格，汉堡王呢才是最刚的。这么多年....",
  likeNum: "111",
  colleactionNum: "20",
  commentNum: "2",
  author: "精于设计的whaleDesign",
  avatar: "/image/avatar/avatar-4.png",
  dateTime: "24小时前",
  detailImg: ["/image/hanbaowang.jpeg"],
  detail: "除了杜蕾斯，汉堡王也是一枚不走寻常路的妖艳贱货呀。\n\n论和麦当劳相爱相杀的，肯德基还不够格，汉堡王才是最刚的。\n这么多年汉堡王做广告就一个原则：恶心麦当劳。\n麦当劳拍过这么一个广告，汽车开在公路上，路边出现两个广告牌：麦当劳前方5km，汉堡王前方258km，广告语“麦当劳离你更近”，明摆着欺负汉堡王门店少。\n汉堡王怎么接呢？ 对呀，我们门店是少，但是我们好吃啊！\n\n他们没多久就更了一条推特：汉堡王续拍了麦当劳的广告。\n  两人到麦当劳买了一杯咖啡，店员问大杯小杯，男人贱贱的回答：“大杯，我们有很长一段路要走呢”。拿了咖啡继续上路，字幕写着“离你的皇堡就剩253km了，感谢无处不在的麦当劳（为我的顾客提供提神的咖啡）”\n广告最后还加了个彩蛋，两人到了汉堡王，一个人说，“也没多远啊”，另一个人说，“可不嘛”。",
  answerId: 201,
  collectionStatus: false,  //收藏
  likeStatus: false,       //点赞
  heartStatus: false,       //感谢
  addStatus: false,
  addProStatus: false,
  //回答
  answers: [{
    
    author: '哈哈哈',
    author_img: "/image/avatar/avatar-1.png",
    ans_img: "/image/answer/ipad-2.jpg",
    content: '哈哈哈：之前写了个预测，说如果上了A11肯定要涨价。结果上了A12，价格大涨，不知道这算不算打脸。其实这俩货发布会之前出来我一点都不意外，我还在文章里面说了它们都是炒冷饭产品完全不是主角。但是...',
    likeNum: "211",
    commentNum: "5",
    create_time: '1552007650',
  },
  ],

  comments: [              //评论
    {
      author: '者也',
      avatar: "/image/avatar/avatar-3.png",
      create_time: '1552006600',
      content: {
        txt: '外国广告可以这么玩，但是中国广告法是不允许的哦',
        img: [],
        audio: null
      }
    },
    {
      author: '蓝眼小鱼',
      avatar: "/image/avatar/avatar-2.png",
      create_time: '1552007600',
      content: {
        txt: '他们的法律允许这种直接怼吗？好多年前移动讽刺别的运营商信号差（还没指名道姓）都被警告了',
        img: [],
        audio: null
      }
    },
  ] 
},

  
]




/*热榜数据*/ 
var hotList=[
  {
    hotId: 1,
    title: "我校举行纪念五四运动100周年暨2019年学生表彰大会",
    titleId:4,
    problem_des:'5月6日，我校在学校大礼堂隆重举行纪念五四运动100周年暨2019年学生表彰大会。校领导李建军、雍和明、刘春阳、张欣出席大会，相关职能部门负责人，各二级学院党总支书记、团总支书记、学生会指导老师以及800多名团员青年参会。',
    hotNum: "888 热度",
    hotImg: "http://www.gduf.edu.cn/__local/4/D8/A1/1990B1866D9A442B8A2D9E8F538_E73378B3_9DB1.jpg",
    addProStatus: false,
    answers: [              //评论
      {
        author: '陈记者',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "http://www.gduf.edu.cn/__local/A/9E/55/78318E14D485566CBD08EA5454D_C774B026_8287.jpg",
        content: '校长雍和明主持大会。雍和明校长说，一百年前的今天，无数心怀天下的仁人志士，在马克思主义精神的深刻感召下，高举“爱国、进步、民主、科学”的伟大旗帜，投入这场轰轰烈烈的救亡图存运动。',
        likeNum: 54,
        commentNum: 54,
        create_time: '1552007600',
      }
    ]
  },
  {
    hotId: 2,
    title: "我校开展“4·26”世界知识产权日系列活动",
    titleId: 5,
    problem_des: '4月26日，是第19个世界知识产权日。为进一步在校园弘扬宪法精神，推广法治文化，宣传和保护知识产权，由我校依法治校领导小组主办，校长办公室、校团委和法学院承办的“弘扬宪法精神、保护知识产权”4·26世界知识产权日系列活动于近期陆续开展。',
    hotNum: "598 热度",
    hotImg: "/image/logo.jpeg",
    addProStatus: false,
    answers: [              //评论
      {
        author: '学生3',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "http://www.gduf.edu.cn/__local/9/AF/2E/099FE326DFDA75703677C866896_A27EB3E6_7565.jpg",
        content: '3月16日至4月28日，由广州市版权保护中心主办，广州市文化馆、广州图书馆、广州朗锐数字传媒科技有限公司协办的第三届“版辩羊城·权论新篇”广州大学生辩论邀请赛正式拉开序幕，由法学院辩论队代表我校参赛。经过激烈角逐，我校代表队最终获得优秀奖。',
        likeNum: 23,
        commentNum: 34,
        create_time: '1552007650',
      },
      {
        author: '学生2',
        author_img: "/image/avatar/avatar-1.png",
        ans_img: "http://www.gduf.edu.cn/__local/7/9B/FB/BD64575FC61FF7B5069ADF2C1B2_44967110_64B0.jpg",
        content: '讲座开始前，法学院与广东省版权保护联合会签署了合作共建协同育人实践基地的协议。今后，双方将在协同育人、协同创新研究、版权行业服务等领域深化合作，也为我校学生提供了新的实习和就业渠道。',
        likeNum: 11,
        commentNum: 22,
        create_time: '1552017600',
      },
      {
        author: '学生1',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "http://www.gduf.edu.cn/__local/5/5F/1C/1674BC8C3833AAC106F48AA9DF5_14D8B096_4A43.jpg",
        content: '应广东省委宣传部邀请，我校派出法学院朱玛副教授和程雪梅两位老师，参与第125届广交会“知识产权和贸易纠纷投诉接待站”的工作，并作为负责人带队处理广交会期间的投诉和维权工作。广交会期间，她们展现了出色的业务能力，工作态度和服务形象获得了主办方和国际友人的高度肯定。',
        likeNum: 23,
        commentNum: 34,
        create_time: '1552018550',
      },
    ]
  },
  {
    hotId: 3,
    title: "我校成功主办“第十一届东亚社会保障模式研讨会”",
    titleId: 6,
    problem_des:'5月4至5日，由广东金融学院、中国社会保障学会医保专委会主办的“第十一届东亚社会保障模式研讨会”在广东肇庆召开，本次会议主题为“人口结构变化、养老保障与儿童福利”。',
    hotNum: "455 热度",
    hotImg: "/image/bh1.jpg",
    answers: [              //评论
      {
        author: '用户名',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "/image/logo.jpeg",
        content: '这里是回答内容预览',
        likeNum: 23,
        commentNum: 34,
        create_time: '1552007600',
      },
    ]
  },
  {
    hotId: 4,
    title: "快乐篮球",
    titleId: 7,
    problem_des: '是ahdhdhdksdskffhhffhfjfffjjfjfjfffhfhhfhfhfhf..',
    hotNum: "400 热度",
    hotImg: "/image/comment/train-1.jpg",
    addProStatus: false,
    answers: [              //评论
      {
        author: '用户1',
        author_img: "/image/avatar/avatar-3.png",
        ans_img: "/image/logo.jpeg",
        content: '这里是回答内容预览',
        likeNum: 23,
        commentNum: 34,
        create_time: '1552007650',
      },
      {
        author: '用户2',
        author_img: "/image/avatar/avatar-1.png",
        ans_img: "/image/answer/ipad-2.jpg",
        content: '这里是回答内容预览',
        likeNum: 0,
        commentNum: 0,
        create_time: '1552017600',
      },
      {
        author: '用户3',
        author_img: "/image/avatar/avatar-2.png",
        ans_img: "/image/answer/ipad-1.jpg",
        content: '前写了个预测，说如果上了A11肯定要涨价。结果上了A12，价格大涨，不知道这算不算打脸。',
        likeNum: 0,
        commentNum: 0,
        create_time: '1553007600',
      },
    ]
  },
  
  
]

var musicList=[{
  musicId:1,
  url: "http://fs.open.kugou.com/c6ae4857986bbec549186d867b91fceb/5ce6831c/G157/M00/1F/0D/fZQEAFzFX3OABI0BAD6qn2w0t7s228.mp3",
  title:"我只喜欢你",
  singer:"胡夏",
  coverImg:'http://imge.kugou.com/stdmusic/240/20190505/20190505181854794759.jpg'
},
  {
    musicId: 2,
    url: "http://fs.open.kugou.com/df0e7714f6856683bab14b91d9877868/5ce65673/G108/M00/0D/0D/DIcBAFvgHyOAUoSLADv7TtiRGW8736.mp3",
    title: "来自天堂的魔鬼",
    singer: "邓紫棋",
    coverImg: 'http://imge.kugou.com/stdmusic/240/20151111/20151111174428152608.jpg'


  },
  {
    musicId: 3,
    url: "http://fs.open.kugou.com/2672ac57793b0810abe45a18dbeed96b/5ce655d4/G129/M01/03/05/wQ0DAFqT0Q6AYSi9ACvEKdWhzy0715.mp3",
    title: "Number",
    singer: "Alexander Oscar",
    coverImg: 'http://imge.kugou.com/stdmusic/240/20180226/20180226172254198246.jpg'
  },
  {
    musicId: 4,
    url: "http://m10.music.126.net/20190605105423/b6d0692951fae8346109b5902b88924a/ymusic/005e/0458/000b/749dd4b08b32d78b64b07a75cc31117b.mp3",
    title: "Carry on",
    singer: "Kygo",
    coverImg: 'https://p3fx.kgimg.com/stdmusic/20190416/20190416154403829130.jpg'
  },
  {
    musicId: 5,
    url: "http://fs.open.kugou.com/937c8b2081e3d4996916031be7b0eed7/5cf72a3d/G162/M02/14/1B/gpQEAFzVxVeAH23uADKgqNrK-P8142.mp3",
    title: "你，好不好？",
    singer: "俞彬",
    coverImg: 'https://p3fx.kgimg.com/stdmusic/20190511/20190511164221303294.jpg'
  },
  {
    musicId: 6,
    url: "http://fs.open.kugou.com/24618633a88802d76d635214fc5287fb/5cf72a56/G163/M06/02/17/g5QEAFzCxRmAaoR-AD3Jz1EHLHM438.mp3",
    title: "世界上没有真正的感同身受",
    singer: "王源",
    coverImg: 'https://p3fx.kgimg.com/stdmusic/20190426/20190426170430244543.jpg'
  },
  {
    musicId: 7,
    url: "http://m10.music.126.net/20190605110024/593ff35d8c4159118b5f895d9bfdd8bc/ymusic/0408/525f/555a/3b2918a07ae5f2cf8a72b0e2637c218c.mp3",
    title: "我真的没有想过今天是星期几",
    singer: "杨默依",
    coverImg: 'http://imge.kugou.com/stdmusic/240/20190603/20190603174243691412.jpg'
  },
]


module.exports={
  commendList:commendList,
  hotList:hotList,
  musicList:musicList
}